#+title:  Evaluaci贸n de la exposici贸n
#+author: Gunnar Wolf

* Desduplicaci贸n

- Tema presentado por :: Valentina Dom铆nguez
- Calificaci贸n global :: Por favor lean todo el archivo para entender de d贸nde
  vienen todos estos n煤meros 

|------------------------+------+--------------------+------+---------|
| Evaluaci贸n  compa帽eros | Peso | Evaluaci贸n docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                   8.77 |  0.3 |               8.65 |  0.7 |    8.69 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Comentarios

Dado que es una presentaci贸n en video, no puedo evaluar /dominio del tema/ y
/presencia/ como lo har铆amos habitualmente. Me centro en las respuestas que
hagan a las preguntas de sus compa帽eros para el primero y en si la presentaci贸n
"suena" le铆da directamente del material que prepararon o expuesta m谩s libremente
para el segundo.


* Evaluaci贸n grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 0 | 5 | 8 |  9.23 |
| Nivel        | 0 | 0 | 1 | 4 | 8 |  9.08 |
| Relevancia   | 0 | 0 | 1 | 3 | 9 |  9.23 |
| Claridad     | 0 | 0 | 2 | 6 | 5 |  8.46 |
| Presencia    | 0 | 2 | 2 | 4 | 5 |  7.85 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  8.77 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compa帽eros

Su exposici贸n recibi贸 los siguientes comentarios anonimizados por
parte de sus compa帽eros:

- El documento elaborado por Dom铆nguez Zavala Valentina asi como el video
  considero que es muy completo y bien estructurado. Aborda el tema de
  manera clara y detallada, cubriendo aspectos fundamentales como su
  definici贸n, importancia, funcionamiento (a nivel de archivo y bloque),
  implementaci贸n (in line y out line), y la combinaci贸n con t茅cnicas de
  compresi贸n. Adem谩s, incluye ejemplos concretos de sistemas de archivos
  como BTRFS, NTFS y ZFS, siento que esto fue una clave importante para
  entender aun mejor la expisicion. Un 10 a la presentacion del tema de
  exposicion.
- Desarrollar un poco m谩s las definiciones de los distintos conceptos
  mencionados.

* Evaluaci贸n por parte del docente

| *Aspecto*                          | *Peso* | *Evaluaci贸n* | *Puntos* |
|------------------------------------+--------+--------------+----------|
| Contenido t茅cnico y profunidad     |    0.3 |            7 |      2.1 |
| Fuentes bibliogr谩ficas             |   0.15 |           10 |      1.5 |
| Organizaci贸n                       |   0.15 |           10 |      1.5 |
| Comunicaci贸n oral y uso del tiempo |   0.25 |           10 |      2.5 |
| Uso de recursos visuales           |   0.15 |            7 |     1.05 |
|------------------------------------+--------+--------------+----------|
| *Global*                           |        |              |     8.65 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios del docente

- La dicci贸n durante la presentaci贸n es buena, pero se nota que est谩s
  presentando material que vas leyendo, porque no es un l茅xico /natural/, y
  tienes que estar re-explicando frecuentemente lo que acabas de decir.
- 隆Ojo con la diferencia entre /memoria/ y /almacenamiento/! Muchas veces
  haces referencia a ambos como sin贸nimos. Hasta donde entiendo, en
  general, la desduplicaci贸n se aplica al almacenamiento a largo plazo (en
  SSDs, discos, unidades en red...), y no en la memoria principal del
  sistema.
- No es que los videos o im谩genes no se beneficien de la compresi贸n. 隆Se
  benefician much铆simo! Sin embargo, pr谩cticamente todos los formatos de
  uso habitual /ya implementan compresi贸n/
  - El algoritmo de compresi贸n es, de hecho, la principal diferencia entre
    los diferentes formatos existentes. Cada tipo de imagen (o video) se
    comprimir谩 mejor con el algoritmo adecuado.
- ZFS No es un sistema de archivos nativo de Linux, y de hecho, muchos
  linuxeros nos negamos a emplearlo por un asunto de licenciamiento. Su
  c贸digo fue desarrollado por Sun Microsystems para su sistema operativo
  Solaris, y una vez que 茅ste fue adquirido por Oracle en 2010 se
  liber贸... pero de forma que resultara /dif铆cil/ incorporarlo a Linux. Lo
  usaron primero en FreeBSD... y hoy en d铆a ya se soporta en varias
  distribuciones de Linux, pero haciendo algunas /maromas legales/ bastante curiosas.
